{"id":12,"date":"2024-02-08T13:31:09","date_gmt":"2024-02-08T13:31:09","guid":{"rendered":"https:\/\/you.csustan.edu\/?p=12"},"modified":"2024-02-08T13:31:10","modified_gmt":"2024-02-08T13:31:10","slug":"dhaka-mayors-cup-curtain-rises-on-saturday","status":"publish","type":"post","link":"https:\/\/you.csustan.edu\/dhaka-mayors-cup-curtain-rises-on-saturday\/","title":{"rendered":"Dhaka Mayor&#8217;s Cup curtain rises on Saturday"},"content":{"rendered":"\n<p>The fourth edition of the &#8216;Dhaka Mayor&#8217;s Cup Inter-Ward Sports Competition&#8217; organized by Dhaka South City Corporation (DSCC) is starting on Saturday (February 10). The curtain of this event is going to rise with a grand opening ceremony at Bir Shresh Shaheed Sepahi Mustafa Kamal Stadium in Kamalapur at 4 pm today.<\/p>\n\n\n\n<p>Spokesman of DSCC. Abu Nacher said that Mayor Barrister Sheikh Fazle Noor Tapas presided over the event. Tajul Islam, Environment Minister Saber Hossain Chowdhury, Member of Bangladesh Awami League Presidium and Member of Parliament for Dhaka-2 Constituency Advocate Kamrul Islam, Joint General Secretary of Bangladesh Awami League and Member of Parliament for Dhaka-8 Constituency AFM Bahauddin Nasim along with members of Parliament from South City as well as Metropolitan South Awami. League president and general secretaries will participate.<\/p>\n\n\n\n<p>64 teams from 75 wards will participate in football, cricket and badminton. The entire competition will be in knock-out format. The inaugural football match between Ward No. 19 and 74 will be held on February 10 at Bir Shresh Shaheed Sepahi Mustafa Kamal Stadium, and the inaugural cricket match between Ward No. 25 and 55 will be held on February 12 at Golapbagh ground. Apart from this, Bangladesh Badminton Federation will hold the opening match of badminton game between wards 31 and 60.<\/p>\n\n\n\n<p>Each winning team in football and cricket will get Rs 7 lakh and the runner-up team will get Rs 5 lakh as prize. And in Badminton, the winning team will get Tk 3 lakh and the runner-up team will get Tk 2 lakh as prize. On March 9, the fourth Dhaka Mayor&#8217;s Cup will come down with the final match and closing ceremony at Bir Shresh Shahid Sepahi Mustafa Kamal Stadium. &nbsp;<\/p>\n\n\n\n<p>In this event, all cricket matches will be held at Golap Bagh Ground, BUET Central Playground, Sergeant Zahurul Haque Hall Playground and all football matches will be held at Sheikh Jamal Sports Academy, Outer Stadium, Motijheel T&amp;T Colony Playground and Dhupkhola International Football Stadium. On the other hand, all badminton matches will be held in Bangladesh Badminton Federation.<\/p>\n\n\n\n<p>Apart from this, participating teams will practice football and cricket at Bakshi Bazar Central Playground, Fazle Rabbi Hall Playground, Bangladesh Ground, Delwar Hossain Playground, Basabo Playground, Orient Club Playground and Samsabad Playground.<\/p>\n\n\n\n<p>Sujan and Balli of Mohammedan Sporting Club for Ward No. 9, Shaun of Fakirapool Young Men&#8217;s Club and Salman of BKSP, Akkas and Ramzan for Ward No. 24, Rajan Howladar for Ward No. 29, Sujan of Brothers Union for Ward No. 33 will participate in the football competition. &nbsp;<\/p>\n\n\n\n<p>On the other hand, Hannan Sarkar for Ward No. 1, Ashraful Islam for Ward No. 2, Ilyas Sunny for Ward No. 22, Javed Omar Belim for Ward No. 27 and Mehrab Hossain Opi for Ward No. 33 will participate in cricket.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The fourth edition of the &#8216;Dhaka Mayor&#8217;s Cup Inter-Ward Sports Competition&#8217; organized by Dhaka South City Corporation (DSCC) is starting on Saturday (February 10). The curtain of this event is going to rise with a grand opening ceremony at Bir Shresh Shaheed Sepahi Mustafa Kamal Stadium in Kamalapur at 4 pm today. Spokesman of DSCC. &#8230; <a title=\"Dhaka Mayor&#8217;s Cup curtain rises on Saturday\" class=\"read-more\" href=\"https:\/\/you.csustan.edu\/dhaka-mayors-cup-curtain-rises-on-saturday\/\" aria-label=\"Read more about Dhaka Mayor&#8217;s Cup curtain rises on Saturday\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/posts\/12"}],"collection":[{"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/comments?post=12"}],"version-history":[{"count":1,"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/posts\/12\/revisions"}],"predecessor-version":[{"id":16,"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/posts\/12\/revisions\/16"}],"wp:attachment":[{"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/media?parent=12"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/categories?post=12"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/you.csustan.edu\/wp-json\/wp\/v2\/tags?post=12"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}