{"id":2325,"date":"2020-11-04T21:47:38","date_gmt":"2020-11-04T21:47:38","guid":{"rendered":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/?page_id=2325"},"modified":"2023-05-12T04:21:40","modified_gmt":"2023-05-12T04:21:40","slug":"nfr-ticket-faq","status":"publish","type":"page","link":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/","title":{"rendered":"NFR Ticket F.A.Q."},"content":{"rendered":"\n<p>The National Finals Rodeo is an end-of-season event featuring professional rodeo cowboys. The championship is known worldwide as the main rodeo event. The event has been held every year since 1959 and every December since 1985. It is an event for fans wanting to see the showcase of the best barrel racers, cowboys and cattle in the USA.<\/p><div class=\"yozob6578574f6d6ef\" ><p class=\"has-text-color has-background\" style=\"background-color: #1612d9; color: #f8f5f7; font-size: 19px; text-align: center;\"><span style=\"color: #ffffff; font-size: 18pt;\"><a style=\"color: #ffffff;\" href=\"https:\/\/cowboychannel.net\/\" target=\"_blank\" rel=\"nofollow\">Watch NFR  2023 Live Online - SUBSCRIBE HERE<\/a><\/span><\/p>\n<table style=\"background-color: white; border-collapse: collapse; border-spacing: 0px; border: 0px; color: #373737; font-family: 'Droid Sans', Helvetica, Arial, sans-serif; font-size: 16px; line-height: 24px; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline; width: 99.2948%; height: 189px;\"><caption style=\"background-color: #f8f8f8; border-bottom-color: #ff4000; border-bottom-style: solid; border-width: 0px 0px 4px; font-family: 'Open Sans Light', 'Open Sans', Arial, sans-serif; font-size: 20px; height: 40px; line-height: 40px; margin: 0px; outline: 0px; padding: 0px 0.5em; text-align: center; vertical-align: baseline; white-space: nowrap;\">NFR  2023 Streaming info<\/caption>\n<tbody>\n<tr style=\"height: 27px;\">\n<td style=\"height: 27px; width: 51.1304%;\"><\/td>\n<td style=\"height: 27px; width: 20.174%;\">Streaming<\/td>\n<\/tr>\n<tr style=\"height: 27px;\">\n<td style=\"height: 27px; width: 51.1304%;\">The Cowboy Channel (real-time)<\/td>\n<td style=\"height: 27px; width: 20.174%;\"><strong><span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/cowboychannel.net\/\" target=\"_blank\" rel=\"nofollow noopener\">Watch Here<\/a><\/span><\/strong><\/td>\n<\/tr>\n<tr style=\"height: 27px;\">\n<td style=\"height: 27px; width: 51.1304%;\">RFD-TV (real-time)<\/td>\n<td style=\"height: 27px; width: 20.174%;\"><strong><span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/cowboychannel.net\/\" target=\"_blank\" rel=\"nofollow noopener\">Watch Here<\/a><\/span><\/strong><\/td>\n<\/tr>\n<tr style=\"height: 27px;\">\n<td style=\"height: 27px; width: 51.1304%;\">Cowboy Channel Plus (International)<\/td>\n<td style=\"height: 27px; width: 20.174%;\"><span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/cowboychannel.net\/\" target=\"_blank\" rel=\"nofollow noopener\">Watch Here<\/a><\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p> <\/p><\/div><style type=\"text\/css\">\r\n@media screen and (min-width: 1201px) {\r\n.yozob6578574f6d6ef {\r\ndisplay: block;\r\n}\r\n}\r\n@media screen and (min-width: 993px) and (max-width: 1200px) {\r\n.yozob6578574f6d6ef {\r\ndisplay: block;\r\n}\r\n}\r\n@media screen and (min-width: 769px) and (max-width: 992px) {\r\n.yozob6578574f6d6ef {\r\ndisplay: block;\r\n}\r\n}\r\n@media screen and (min-width: 768px) and (max-width: 768px) {\r\n.yozob6578574f6d6ef {\r\ndisplay: block;\r\n}\r\n}\r\n@media screen and (max-width: 767px) {\r\n.yozob6578574f6d6ef {\r\ndisplay: block;\r\n}\r\n}\r\n<\/style>\r\n\n\n\n\n<p>This year the event is <a href=\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/schedule\/\">scheduled<\/a> from December 7th to December 16th. While it is the richest and most prestigious event, it also has a lot of fans, which makes its tickets very popular.<\/p>\n\n\n\n<p>Here we intend to answer Frequently asked questions related to NFR tickets.<\/p>\n\n\n\n<p><strong><em>What are the prices of NFR tickets?<\/em><\/strong><\/p>\n\n\n\n<p>The National Finals Rodeo tickets are available in three packages depending on whether you want to buy as an individual or for the season.<\/p>\n\n\n\n<p>The prices are as follows; In the balcony package, individual and season tickets sold for USD 76 and USD 760. In the Plaza Package, $ 105 for individuals and $ 1050 for a season. The expensive package is Gold Buckle, $ 300 for individuals, and $ 3000 for a season.<\/p>\n\n\n\n<p><strong><em>Where can I purchase NFR tickets?<\/em><\/strong><\/p>\n\n\n\n<p>These tickets can be purchased at <a href=\"http:\/\/www.UNLVTickets.com\">www.UNLVTickets.com<\/a> .Fans can also buy their tickets at the official National Finals Rodeo on site. The ticket exchange will take place at Cowboy Christmas.<\/p>\n\n\n\n<p><strong><em>What are Mad dash ticket and where can I buy them?<\/em><\/strong><\/p>\n\n\n\n<p>And in case you want to buy a ticket for a sold outperformance, there is the only ticket, the Mad Dash Ticket, that gives you that option. It is important that the Mad Dash tickets are balcony tickets and can be bought directly at the cash desk of the Thomas and Mack Center. They can also be purchased from the website www.UNLVTickets.com.<\/p>\n\n\n\n<p>This type of ticket gives the owner the option to take a free space in the balcony area or to watch the event on the large video screens in the Cox Pavilion.<\/p>\n\n\n\n<p><strong><em>Do I require to buy tickets for kids and at what age?<\/em><\/strong><\/p>\n\n\n\n<p>Children under 3 years of age don’t require tickets. However, this is only when the child can sit on the lap of the parent or legal guardian.<\/p>\n\n\n\n<p><strong><em>Can I attend the event even if my ticket is lost?<\/em><\/strong><\/p>\n\n\n\n<p>It is true that it is possible that the purchased ticket can be lost before it is presented at the entrance of the event of your favorite. However, it ought not to be panic situation as it doesn&#8217;t deny you the opportunity that you have already paid for.<\/p>\n\n\n\n<p>If this happens and you purchased your ticket through Las Vegas, StubHub, or UNLV, it can be reprinted. You&#8217;ll need to contact the Las Vegas event office, then fill out the ticket reprint form, and pay the reprint fees as well.<\/p>\n\n\n\n<p><strong><em>How can I find my seat after buying the ticket?<\/em><\/strong><\/p>\n\n\n\n<p>Your ticket has a number with which you first locate the entrance. The stadium has three entrances, the main entrance, the shoes and the coral. Please see the <a href=\"https:\/\/www.nfrexperience.com\/images\/uploads\/PreferredEntrances_2020.pdf\">NFR seating map<\/a> for more information.<\/p>\n\n\n\n<p><strong><em>How can I avoid being scammed when buying my ticket?<\/em><\/strong><\/p>\n\n\n\n<p>While the tickets are in high demand, many have been victims of fraud. But for you who don&#8217;t want to end up in the same situation, make sure you buy your ticket through an approved dealer rather than a scalper. Buying tickets through approved dealers has the advantage. One of them will be support in the event of a lost ticket or problems with the purchased ticket.<\/p>\n\n\n\n<p><strong><em>When can I extend my season ticket?<\/em><\/strong><\/p>\n\n\n\n<p>The renewal of tickets for the season usually takes place between February and April of each year. You will probably receive an invoice with a due date of April at the end of February. If you don&#8217;t receive a mailed invoice to renew your season ticket by mid-March, you should contact the Las Vegas Events Ticket Office.<\/p>\n\n\n\n<p>The renewal of the season ticket is not automatic. It is therefore the responsibility of the owner to contact the ticket office if the renewal invoice is not received by mid-March each year.<\/p>\n\n\n\n<p><strong><em>When will I get my ticket?<\/em><\/strong><\/p>\n\n\n\n<p>Tickets are sent out in early October every year. You should contact the Las Vegas ticket office immediately if you do not receive your ticket by October 14th.<\/p>\n\n\n\n<p><strong><em>How are season tickets sent?<\/em><\/strong><\/p>\n\n\n\n<p>They are sent via FedEx mail. However, this is not the case for owners with a PO Box address. Their tickets are sent through the United States Postal Service, and those with Canadian accounts will also have their tickets sent through USPS. A signature is not required for tickets sent by post. You will only receive an email with a tracking number when your ticket is dispatched.<\/p>\n\n\n\n<p><strong><em>What is the NFR Ticket Policy?<\/em><\/strong><\/p>\n\n\n\n<p>It&#8217;s a detailed explanation of all the policies and procedures related to NFR ticketing. The NFR Ticket Policy also applies to the Transfer and will form, as well as the information change form.<\/p>\n\n\n\n<p><strong><em>How can I update the account address and contact information on my season ticket?<\/em><\/strong><\/p>\n\n\n\n<p>In order to update the account address of your season ticket, you as the account holder of the data record must first fill out and sign the change of information(COI). A maximum of two account holders is permitted per season ticket. However, if there is only one account holder on record and you want to add an immediate family member who is defined as a living spouse or child under the NFR Ticket Policy, you can do so by filling the specified portion of the COI form.<\/p>\n\n\n\n<p>For Las Vegas events, the process is preferably done via email. So make sure you have the most up-to-date email address in your account so as not to miss crucial updates. The deadline for updating your address in time for tickets to be sent ends on August 1st.<\/p>\n\n\n\n<p><strong><em>Is it possible to will or transfer my NFR season ticket and to who?<\/em><\/strong><\/p>\n\n\n\n<p>It is possible to will or transfer your NFR season ticket. However, this only applies to the immediate family member, as it is if you want to add a second name or an account holder. Under the NFR Policy, an immediate family member is either a living spouse or a child.<\/p>\n\n\n\n<p>Only up to two account holders are allowed at a time.<strong><\/strong><\/p>\n\n\n\n<p><strong><em>Is willing different from the NFR season ticket transfer?<\/em><\/strong><\/p>\n\n\n\n<p>They&#8217;re different. When making a transfer, the account holders lose all rights they have on the ticket with effect as soon as the ticket office has received the required documents.<\/p>\n\n\n\n<p>But on willing, the account holder can determine who should take over the account if something happens to the account holder.<\/p>\n\n\n\n<p><strong><em>For what reasons did the NFR adopt a clear bag directive?<\/em><\/strong><\/p>\n\n\n\n<p>The Wrangler NFR adopted a clear policy to improve public safety and accessibility. Fans can come with a clear bag that is no bigger than 12 by 6 by 12 inches. Alternatively, you can bring a 1-gallon plastic bag. There is also a limit for a clear bag and small clutch bag no bigger than 4.5 &#8220;by 6.5&#8221; per person. This improves privacy.<\/p>\n\n\n\n<p><strong><em>How many bags can I bring?<\/em><\/strong><\/p>\n\n\n\n<p>Each ticket holder can bring a clear bag, which can be either a one-gallon Ziploc bag or a clear bag no bigger than 12 by 6 by 12 inches. In addition, a small clutch wallet no bigger than 4.5 by 6.5 inches is permitted. The small clutch can be used to carry small personal items privately into the venue.<\/p>\n\n\n\n<p><strong><em>What if I show up with a prohibited bag?<\/em><\/strong><\/p>\n\n\n\n<p>You are not allowed to enter the venue if you are carrying a prohibited bag. You will either need to return the bag in your vehicle and convert the associated bag to an approved bag per the clear bag policy. You can also drop off the bag at WNR check-in in the Mendenhall Center lobby.<\/p>\n\n\n\n<p><br><strong><em>What do I do if I have to bring medical items to the venue but they don&#8217;t fit in the clear bag?<\/em><\/strong><\/p>\n\n\n\n<p>Medical items or guests carrying medical bags will be thoroughly checked prior to entering the venue.<\/p>\n\n\n\n<p><strong><em>Are diaper bags allowed?<\/em><\/strong><\/p>\n\n\n\n<p>They are allowed. However, they will be checked thoroughly before being taken to the venue.<\/p>\n\n\n\n<p><strong><em>Are there WNR merchandise and are they allowed?<\/em><\/strong><\/p>\n\n\n\n<p>Yes, there are Wrangler NFR merchandise no bigger than 20 &#8220;by 20&#8221; that is approved at the venue. These are approved goods that each ticket holder can bring along in addition to the approved clear bag and small clutch wallet. However, all merchandise is thoroughly checked at the entrance.<\/p>\n\n\n\n<p><strong><em>Are all wallets banned?<\/em><\/strong><\/p>\n\n\n\n<p>Not all wallets are banned. Small purses no bigger than 4.5 &#8220;by 6.5&#8221; are permitted for private transportation of personal items to the venue.<\/p>\n\n\n\n<p><strong><em>What is a fan-convenient clear bag policy like?<\/em><\/strong><\/p>\n\n\n\n<p>The policy makes it quicker for staff to move fans through checkpoints and also makes it more efficient and convenient to check bags brought to the venue.<\/p>\n\n\n\n<p>The aim is to cut the time in line and allow fans to sit in their seats before the opening ceremony. This will also improve the safety of fans in the arena.<\/p>\n\n\n\n<p><strong><em>What other bags are allowed in?<\/em><\/strong><\/p>\n\n\n\n<p>Bags other than a clutch wallet is allowed. However, any bag that does not meet the clear bag guideline will be thoroughly examined. This includes bags, whether clear, made of plastic or vinyl and no bigger than 12 x 6 x 12 inches, a one-gallon Ziploc bag, hand-sized clutch bags, diaper bags, medical bags and finally, an approved clear WNFR merchandise bag not bigger than 20 x 20 inches in measurement.<\/p>\n\n\n\n<p><strong><em>What are the bags not allowed?<\/em><\/strong><\/p>\n\n\n\n<p>If a bag is not clear and is bigger than 12 by 6 by 12 inches, it is prohibited. These include handbags, tote bags, backpacks, briefcases, large purses, computer bags, cool bags, binocular bags, camera bags, etc.<\/p>\n\n\n\n<p><strong><em>Are there any prohibited items?<\/em><\/strong><\/p>\n\n\n\n<p>For the safety and comfort of fans in the arena, some items are not permitted. These included air horns, balloons, cowbells, artificial noisemakers, ice boxes, thermos flasks, weapons and dangerous objects such as knives, Cans, laser pointers, camera stands and so on.<\/p>\n\n\n\n<p><strong><em>How do I post my ticket for resale through StubHub on my account?<\/em><\/strong><\/p>\n\n\n\n<p>For added security and convenience, NFR has created a process that allows you to publish your ticket to a potential buyer using the My Account feature on StubHub. These sales are subject to the StubHub Terms and Conditions as well as Resale Fee Structure<\/p>\n\n\n\n<p>To sell your ticket on StubHub, log into your account, choose to sell the NFR tickets on StubHub and post your ticket after you have set the price.<\/p>\n\n\n\n<p>You will receive the money for the ticket via the payment method you have specified.<\/p>\n\n\n\n<p>Once the ticket has been resold, it will be removed from your account and a new ticket will be digitally created upon purchase.<\/p>\n\n\n\n<p><strong><em>Can I list the ticket directly on the StubHub website?<\/em><\/strong><\/p>\n\n\n\n<p>Yes, but you will receive a notification reminding you to come back and manually enter the barcode for the resale to proceed. This is also the case if you listed your ticket directly on StubHub before setting up &#8220;My Account&#8221;.<\/p>\n\n\n\n<p><strong><em>Can I resell my ticket on other secondary market sites?<\/em><\/strong><\/p>\n\n\n\n<p>While you can, there are many reasons why it is recommended over StubHub. This is the safest and most convenient way to list and resell your ticket. Whereas NFR ticketing is integrated, a verified ticket is sent to the purchase with no effort. The seller and buyer are not required to meet or talk to each other to exchange a printed souvenir ticket.<\/p>\n\n\n\n<p><strong><em>Will I be charged for listing tickets on StubHub?<\/em><\/strong><\/p>\n\n\n\n<p>Whereas ticket booking is subject to StubHub&#8217;s terms and conditions and the fee structure, fees apply.<\/p>\n\n\n\n<p><strong><em>How do I get my payment after my ticket is sold on StubHub?<\/em><\/strong><\/p>\n\n\n\n<p>Payment direct from StubHub will be sent to the payment method you specified.<\/p>\n\n\n\n<p><strong><em>What happens if the advertised ticket is not sold or I change my mind?<\/em><\/strong><\/p>\n\n\n\n<p>If you have a different opinion after listing your ticket, you can pull it down or delist it at any time, provided the purchase has not been completed. Once sold, it is final and your original ticket or printed souvenir will be invalid.<\/p>\n\n\n\n<p><strong><em>What happens to my originally printed souvenir?<\/em><\/strong><\/p>\n\n\n\n<p><strong><em>After selling the ticket?<\/em><\/strong><\/p>\n\n\n\n<p>Once the sale is complete, the original printed souvenir ticket will be invalid. However, it is your job to keep track of your ticket usage and securely keep your printed souvenir ticket.<\/p>\n\n\n\n<p>Once they have been successfully resold, you should no longer distribute any of the original printed souvenir tickets and should be destroyed or secured.<\/p>\n\n\n\n<p><strong><em>Does Thomas and Mack&#8217;s center have parking?<\/em><\/strong><\/p>\n\n\n\n<p>Yes, although very limited and its availability subject to first-come, first-served basis per each performance. For disabled fans, they should accompany a state-issued disabled placard or license plate in order to have access.<\/p>\n\n\n\n<p><strong><em>I need ADA seats. How can I get this?<\/em><\/strong><\/p>\n\n\n\n<p>ADA seating is available to both NFR season ticket owners and the general public. If you are an NFR season ticket holder and would like ADA seating, you can get in touch with the Las Vegas Events Ticket Office. This should be done within the renewal time of the season ticket.<\/p>\n\n\n\n<p>For holders of non-season tickets who are interested in participating in the NFR and also want ADA seats, you should contact Thomas and Mack ticket office as soon as the tickets are available to the public.<\/p>\n\n\n\n<p><strong><em>Who is eligible for ADA seats?<\/em><\/strong><\/p>\n\n\n\n<p>NFR ADA seats are reserved for disabled fans under ADA laws. This includes fans that require a wheelchair or other device for mobility, and those that cannot physically use the standard seat in the arena.<\/p>\n\n\n\n<p><strong><em>Can I resell my ADA ticket?<\/em><\/strong><\/p>\n\n\n\n<p>The resale of ADA tickets is prohibited and serves to preserve their integrity. ADA ticket holders are therefore discouraged from reselling their tickets either in person or online, even if they are selling to ambulatory fans. It is recommended that such tickets be returned to the Las Vegas Events Ticket Office for a refund of the face value of the ticket. It should be noted that refunds are only given to the original purchaser of the ticket.<\/p>\n\n\n\n<p><strong><em>How can I contact the ticket office?<\/em><\/strong><\/p>\n\n\n\n<p>To contact the Las Vegas ticket office or ticket office representative, sent your email to <a href=\"mailto:TicketOffice@lasvegasevents.com\">TicketOffice@lasvegasevents.com<\/a> or call (702) 260-8605 directly. The Thomas and Mack Center can be called at (702) 739-3267 or (866) 388-3267.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The National Finals Rodeo is an end-of-season event featuring professional rodeo cowboys. The championship is known worldwide as the main rodeo event. The event has been held every year since 1959 and every December since 1985. It is an event for fans wanting to see the showcase of the best barrel racers, cowboys and cattle [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>NFR Ticket F.A.Q. - Watch Las Vegas NFR 2023<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"NFR Ticket F.A.Q. - Watch Las Vegas NFR 2023\" \/>\n<meta property=\"og:description\" content=\"The National Finals Rodeo is an end-of-season event featuring professional rodeo cowboys. The championship is known worldwide as the main rodeo event. The event has been held every year since 1959 and every December since 1985. It is an event for fans wanting to see the showcase of the best barrel racers, cowboys and cattle [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/\" \/>\n<meta property=\"og:site_name\" content=\"Watch Las Vegas NFR 2023\" \/>\n<meta property=\"article:modified_time\" content=\"2023-05-12T04:21:40+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/\",\"url\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/\",\"name\":\"NFR Ticket F.A.Q. - Watch Las Vegas NFR 2023\",\"isPartOf\":{\"@id\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/#website\"},\"datePublished\":\"2020-11-04T21:47:38+00:00\",\"dateModified\":\"2023-05-12T04:21:40+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"NFR Ticket F.A.Q.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/#website\",\"url\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/\",\"name\":\"NFR 2022 Live Stream\",\"description\":\"National Finals Rodeo\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"NFR Ticket F.A.Q. - Watch Las Vegas NFR 2023","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/","og_locale":"en_US","og_type":"article","og_title":"NFR Ticket F.A.Q. - Watch Las Vegas NFR 2023","og_description":"The National Finals Rodeo is an end-of-season event featuring professional rodeo cowboys. The championship is known worldwide as the main rodeo event. The event has been held every year since 1959 and every December since 1985. It is an event for fans wanting to see the showcase of the best barrel racers, cowboys and cattle [&hellip;]","og_url":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/","og_site_name":"Watch Las Vegas NFR 2023","article_modified_time":"2023-05-12T04:21:40+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/","url":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/","name":"NFR Ticket F.A.Q. - Watch Las Vegas NFR 2023","isPartOf":{"@id":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/#website"},"datePublished":"2020-11-04T21:47:38+00:00","dateModified":"2023-05-12T04:21:40+00:00","breadcrumb":{"@id":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/nfr-ticket-faq\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/"},{"@type":"ListItem","position":2,"name":"NFR Ticket F.A.Q."}]},{"@type":"WebSite","@id":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/#website","url":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/","name":"NFR 2022 Live Stream","description":"National Finals Rodeo","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"_links":{"self":[{"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/pages\/2325"}],"collection":[{"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/comments?post=2325"}],"version-history":[{"count":0,"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/pages\/2325\/revisions"}],"wp:attachment":[{"href":"https:\/\/fd-uat-autopayroll-app.apps.dfes.wa.gov.au\/wp-json\/wp\/v2\/media?parent=2325"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}